# GroupSet Properties

---
The GroupSet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of groups that are in the set.
Top
#### Reference
GroupSet Class
Autodesk.Revit.DB Namespace